DreamLand7707/stm32-ov5640/ov5640_reg.h
    /* format control [0x4300 ~ 0x430D]                      */
    #define OV5640_FORMAT_CTRL00                0x4300U
    #define OV5640_FORMAT_CTRL01                0x4301U
    #define OV5640_YMAX_VAL_HIGH                0x4302U
    #define OV5640_YMAX_VAL_LOW                 0x4303U
    #define OV5640_YMIN_VAL_HIGH                0x4304U
    #define OV5640_YMIN_VAL_LOW                 0x4305U
    #define OV5640_UMAX_VAL_HIGH                0x4306U
    #define OV5640_UMAX_VAL_LOW                 0x4307U
    #define OV5640_UMIN_VAL_HIGH                0x4308U
    #define OV5640_UMIN_VAL_LOW                 0x4309U
    #define OV5640_VMAX_VAL_HIGH                0x430AU
    #define OV5640_VMAX_VAL_LOW                 0x430BU
    #define OV5640_VMIN_VAL_HIGH                0x430CU
    #define OV5640_VMIN_VAL_LOW                 0x430DU

    /* JPEG control [0x4400 ~ 0x4431]                        */
    #define OV5640_JPEG_CTRL00                  0x4400U
    #define OV5640_JPEG_CTRL01                  0x4401U
    #define OV5640_JPEG_CTRL02                  0x4402U
    #define OV5640_JPEG_CTRL03                  0x4403U
    #define OV5640_JPEG_CTRL04                  0x4404U
    #define OV5640_JPEG_CTRL05                  0x4405U
    #define OV5640_JPEG_CTRL06                  0x4406U
    #define OV5640_JPEG_CTRL07                  0x4407U
    #define OV5640_JPEG_ISI_CTRL1               0x4408U
    #define OV5640_JPEG_CTRL09                  0x4409U
    #define OV5640_JPEG_CTRL0A                  0x440AU
    #define OV5640_JPEG_CTRL0B                  0x440BU
    #define OV5640_JPEG_CTRL0C                  0x440CU
    #define OV5640_JPEG_QT_DATA                 0x4410U
    #define OV5640_JPEG_QT_ADDR                 0x4411U
    #define OV5640_JPEG_ISI_DATA                0x4412U
    #define OV5640_JPEG_ISI_CTRL2               0x4413U
    #define OV5640_JPEG_LENGTH_BYTE3            0x4414U
    #define OV5640_JPEG_LENGTH_BYTE2            0x4415U
    #define OV5640_JPEG_LENGTH_BYTE1            0x4416U
    #define OV5640_JFIFO_OVERFLOW               0x4417U

    /* VFIFO control [0x4600 ~ 0x460D]                       */
    #define OV5640_VFIFO_CTRL00                 0x4600U
    #define OV5640_VFIFO_HSIZE_HIGH             0x4602U
    #define OV5640_VFIFO_HSIZE_LOW              0x4603U
    #define OV5640_VFIFO_VSIZE_HIGH             0x4604U
    #define OV5640_VFIFO_VSIZE_LOW              0x4605U
    #define OV5640_VFIFO_CTRL0C                 0x460CU
    #define OV5640_VFIFO_CTRL0D                 0x460DU

    /* DVP control [0x4709 ~ 0x4745]                         */
    #define OV5640_DVP_VSYNC_WIDTH0             0x4709U
    #define OV5640_DVP_VSYNC_WIDTH1             0x470AU
    #define OV5640_DVP_VSYNC_WIDTH2             0x470BU
    #define OV5640_PAD_LEFT_CTRL                0x4711U
    #define OV5640_PAD_RIGHT_CTRL               0x4712U
    #define OV5640_JPG_MODE_SELECT              0x4713U
    #define OV5640_656_DUMMY_LINE               0x4715U
    #define OV5640_CCIR656_CTRL                 0x4719U
    #define OV5640_HSYNC_CTRL00                 0x471BU
    #define OV5640_DVP_VSYN_CTRL                0x471DU
    #define OV5640_DVP_HREF_CTRL                0x471FU
    #define OV5640_VSTART_OFFSET                0x4721U
    #define OV5640_VEND_OFFSET                  0x4722U
    #define OV5640_DVP_CTRL23                   0x4723U
    #define OV5640_CCIR656_CTRL00               0x4730U
    #define OV5640_CCIR656_CTRL01               0x4731U
    #define OV5640_CCIR656_FS                   0x4732U
    #define OV5640_CCIR656_FE                   0x4733U
    #define OV5640_CCIR656_LS                   0x4734U
    #define OV5640_CCIR656_LE                   0x4735U
    #define OV5640_CCIR656_CTRL06               0x4736U
    #define OV5640_CCIR656_CTRL07               0x4737U
    #define OV5640_CCIR656_CTRL08               0x4738U
    #define OV5640_POLARITY_CTRL                0x4740U
    #define OV5640_TEST_PATTERN                 0x4741U
    #define OV5640_DATA_ORDER                   0x4745U

    /* MIPI control [0x4800 ~ 0x4837]                        */
    #define OV5640_MIPI_CTRL00                  0x4800U
    #define OV5640_MIPI_CTRL01                  0x4801U
    #define OV5640_MIPI_CTRL05                  0x4805U
    #define OV5640_MIPI_DATA_ORDER              0x480AU
    #define OV5640_MIN_HS_ZERO_HIGH             0x4818U
    #define OV5640_MIN_HS_ZERO_LOW              0x4819U
    #define OV5640_MIN_MIPI_HS_TRAIL_HIGH       0x481AU
    #define OV5640_MIN_MIPI_HS_TRAIL_LOW        0x481BU
    #define OV5640_MIN_MIPI_CLK_ZERO_HIGH       0x481CU
    #define OV5640_MIN_MIPI_CLK_ZERO_LOW        0x481DU
    #define OV5640_MIN_MIPI_CLK_PREPARE_HIGH    0x481EU
    #define OV5640_MIN_MIPI_CLK_PREPARE_LOW     0x481FU
    #define OV5640_MIN_CLK_POST_HIGH            0x4820U
    #define OV5640_MIN_CLK_POST_LOW             0x4821U
    #define OV5640_MIN_CLK_TRAIL_HIGH           0x4822U
    #define OV5640_MIN_CLK_TRAIL_LOW            0x4823U
    #define OV5640_MIN_LPX_PCLK_HIGH            0x4824U
    #define OV5640_MIN_LPX_PCLK_LOW             0x4825U
    #define OV5640_MIN_HS_PREPARE_HIGH          0x4826U
    #define OV5640_MIN_HS_PREPARE_LOW           0x4827U
    #define OV5640_MIN_HS_EXIT_HIGH             0x4828U
    #define OV5640_MIN_HS_EXIT_LOW              0x4829U
    #define OV5640_MIN_HS_ZERO_UI               0x482AU
    #define OV5640_MIN_HS_TRAIL_UI              0x482BU
    #define OV5640_MIN_CLK_ZERO_UI              0x482CU
    #define OV5640_MIN_CLK_PREPARE_UI           0x482DU
    #define OV5640_MIN_CLK_POST_UI              0x482EU
    #define OV5640_MIN_CLK_TRAIL_UI             0x482FU
    #define OV5640_MIN_LPX_PCLK_UI              0x4830U
    #define OV5640_MIN_HS_PREPARE_UI            0x4831U
    #define OV5640_MIN_HS_EXIT_UI               0x4832U
    #define OV5640_PCLK_PERIOD                  0x4837U

    /* ISP frame control [0x4901 ~ 0x4902]                   */
    #define OV5640_ISP_FRAME_CTRL01             0x4901U
    #define OV5640_ISP_FRAME_CTRL02             0x4902U

    /* ISP top control [0x5000 ~ 0x5063]                     */
    #define OV5640_ISP_CONTROL00                0x5000U
    #define OV5640_ISP_CONTROL01                0x5001U
    #define OV5640_ISP_CONTROL03                0x5003U
    #define OV5640_ISP_CONTROL05                0x5005U
    #define OV5640_ISP_MISC0                    0x501DU
    #define OV5640_ISP_MISC1                    0x501EU
    #define OV5640_FORMAT_MUX_CTRL              0x501FU
    #define OV5640_DITHER_CTRL0                 0x5020U
    #define OV5640_DRAW_WINDOW_CTRL00           0x5027U
    #define OV5640_DRAW_WINDOW_LEFT_CTRL_HIGH   0x5028U
    #define OV5640_DRAW_WINDOW_LEFT_CTRL_LOW    0x5029U
    #define OV5640_DRAW_WINDOW_RIGHT_CTRL_HIGH  0x502AU
    #define OV5640_DRAW_WINDOW_RIGHT_CTRL_LOW   0x502BU
    #define OV5640_DRAW_WINDOW_TOP_CTRL_HIGH    0x502CU
    #define OV5640_DRAW_WINDOW_TOP_CTRL_LOW     0x502DU
    #define OV5640_DRAW_WINDOW_BOTTOM_CTRL_HIGH 0x502EU
    #define OV5640_DRAW_WINDOW_BOTTOM_CTRL_LOW  0x502FU
    #define OV5640_DRAW_WINDOW_HBW_CTRL_HIGH    0x5030U /* HBW: Horizontal Boundary Width */
    #define OV5640_DRAW_WINDOW_HBW_CTRL_LOW     0x5031U
    #define OV5640_DRAW_WINDOW_VBW_CTRL_HIGH    0x5032U /* VBW: Vertical Boundary Width */
    #define OV5640_DRAW_WINDOW_VBW_CTRL_LOW     0x5033U
    #define OV5640_DRAW_WINDOW_Y_CTRL           0x5034U
    #define OV5640_DRAW_WINDOW_U_CTRL           0x5035U
    #define OV5640_DRAW_WINDOW_V_CTRL           0x5036U
    #define OV5640_PRE_ISP_TEST_SETTING1        0x503DU
    #define OV5640_ISP_SENSOR_BIAS_I            0x5061U
    #define OV5640_ISP_SENSOR_GAIN1_I           0x5062U
    #define OV5640_ISP_SENSOR_GAIN2_I           0x5063U

