DreamLand7707/stm32-ov5640/ov5640_reg.h
    /* AWB control [0x5180 ~ 0x51D0]                         */
    #define OV5640_AWB_CTRL00                   0x5180U
    #define OV5640_AWB_CTRL01                   0x5181U
    #define OV5640_AWB_CTRL02                   0x5182U
    #define OV5640_AWB_CTRL03                   0x5183U
    #define OV5640_AWB_CTRL04                   0x5184U
    #define OV5640_AWB_CTRL05                   0x5185U
    #define OV5640_AWB_CTRL06                   0x5186U /* Advanced AWB control registers: 0x5186 ~ 0x5190 */
    #define OV5640_AWB_CTRL07                   0x5187U
    #define OV5640_AWB_CTRL08                   0x5188U
    #define OV5640_AWB_CTRL09                   0x5189U
    #define OV5640_AWB_CTRL10                   0x518AU
    #define OV5640_AWB_CTRL11                   0x518BU
    #define OV5640_AWB_CTRL12                   0x518CU
    #define OV5640_AWB_CTRL13                   0x518DU
    #define OV5640_AWB_CTRL14                   0x518EU
    #define OV5640_AWB_CTRL15                   0x518FU
    #define OV5640_AWB_CTRL16                   0x5190U
    #define OV5640_AWB_CTRL17                   0x5191U
    #define OV5640_AWB_CTRL18                   0x5192U
    #define OV5640_AWB_CTRL19                   0x5193U
    #define OV5640_AWB_CTRL20                   0x5194U
    #define OV5640_AWB_CTRL21                   0x5195U
    #define OV5640_AWB_CTRL22                   0x5196U
    #define OV5640_AWB_CTRL23                   0x5197U
    #define OV5640_AWB_CTRL24                   0x5198U
    #define OV5640_AWB_CTRL25                   0x5199U
    #define OV5640_AWB_CTRL26                   0x519AU
    #define OV5640_AWB_CTRL27                   0x519BU
    #define OV5640_AWB_CTRL28                   0x519CU
    #define OV5640_AWB_CTRL29                   0x519DU
    #define OV5640_AWB_CTRL30                   0x519EU
    #define OV5640_AWB_CURRENT_R_GAIN_HIGH      0x519FU
    #define OV5640_AWB_CURRENT_R_GAIN_LOW       0x51A0U
    #define OV5640_AWB_CURRENT_G_GAIN_HIGH      0x51A1U
    #define OV5640_AWB_CURRENT_G_GAIN_LOW       0x51A2U
    #define OV5640_AWB_CURRENT_B_GAIN_HIGH      0x51A3U
    #define OV5640_AWB_CURRENT_B_GAIN_LOW       0x51A4U
    #define OV5640_AWB_AVERAGE_R                0x51A5U
    #define OV5640_AWB_AVERAGE_G                0x51A6U
    #define OV5640_AWB_AVERAGE_B                0x51A7U
    #define OV5640_AWB_CTRL74                   0x5180U

    /* CIP control [0x5300 ~ 0x530F]                         */
    #define OV5640_CIP_SHARPENMT_TH1            0x5300U
    #define OV5640_CIP_SHARPENMT_TH2            0x5301U
    #define OV5640_CIP_SHARPENMT_OFFSET1        0x5302U
    #define OV5640_CIP_SHARPENMT_OFFSET2        0x5303U
    #define OV5640_CIP_DNS_TH1                  0x5304U
    #define OV5640_CIP_DNS_TH2                  0x5305U
    #define OV5640_CIP_DNS_OFFSET1              0x5306U
    #define OV5640_CIP_DNS_OFFSET2              0x5307U
    #define OV5640_CIP_CTRL                     0x5308U
    #define OV5640_CIP_SHARPENTH_TH1            0x5309U
    #define OV5640_CIP_SHARPENTH_TH2            0x530AU
    #define OV5640_CIP_SHARPENTH_OFFSET1        0x530BU
    #define OV5640_CIP_SHARPENTH_OFFSET2        0x530CU
    #define OV5640_CIP_EDGE_MT_AUTO             0x530DU
    #define OV5640_CIP_DNS_TH_AUTO              0x530EU
    #define OV5640_CIP_SHARPEN_TH_AUTO          0x530FU

    /* CMX control [0x5380 ~ 0x538B]                         */
    #define OV5640_CMX_CTRL                     0x5380U
    #define OV5640_CMX1                         0x5381U
    #define OV5640_CMX2                         0x5382U
    #define OV5640_CMX3                         0x5383U
    #define OV5640_CMX4                         0x5384U
    #define OV5640_CMX5                         0x5385U
    #define OV5640_CMX6                         0x5386U
    #define OV5640_CMX7                         0x5387U
    #define OV5640_CMX8                         0x5388U
    #define OV5640_CMX9                         0x5389U
    #define OV5640_CMXSIGN_HIGH                 0x538AU
    #define OV5640_CMXSIGN_LOW                  0x538BU

    /* gamma control [0x5480 ~ 0x5490]                       */
    #define OV5640_GAMMA_CTRL00                 0x5480U
    #define OV5640_GAMMA_YST00                  0x5481U
    #define OV5640_GAMMA_YST01                  0x5482U
    #define OV5640_GAMMA_YST02                  0x5483U
    #define OV5640_GAMMA_YST03                  0x5484U
    #define OV5640_GAMMA_YST04                  0x5485U
    #define OV5640_GAMMA_YST05                  0x5486U
    #define OV5640_GAMMA_YST06                  0x5487U
    #define OV5640_GAMMA_YST07                  0x5488U
    #define OV5640_GAMMA_YST08                  0x5489U
    #define OV5640_GAMMA_YST09                  0x548AU
    #define OV5640_GAMMA_YST0A                  0x548BU
    #define OV5640_GAMMA_YST0B                  0x548CU
    #define OV5640_GAMMA_YST0C                  0x548DU
    #define OV5640_GAMMA_YST0D                  0x548EU
    #define OV5640_GAMMA_YST0E                  0x548FU
    #define OV5640_GAMMA_YST0F                  0x5490U

    /* SDE control [0x5580 ~ 0x558C]                         */
    #define OV5640_SDE_CTRL0                    0x5580U
    #define OV5640_SDE_CTRL1                    0x5581U
    #define OV5640_SDE_CTRL2                    0x5582U
    #define OV5640_SDE_CTRL3                    0x5583U
    #define OV5640_SDE_CTRL4                    0x5584U
    #define OV5640_SDE_CTRL5                    0x5585U
    #define OV5640_SDE_CTRL6                    0x5586U
    #define OV5640_SDE_CTRL7                    0x5587U
    #define OV5640_SDE_CTRL8                    0x5588U
    #define OV5640_SDE_CTRL9                    0x5589U
    #define OV5640_SDE_CTRL10                   0x558AU
    #define OV5640_SDE_CTRL11                   0x558BU
    #define OV5640_SDE_CTRL12                   0x558CU

    /* scale control [0x5600 ~ 0x5606]                       */
    #define OV5640_SCALE_CTRL0                  0x5600U
    #define OV5640_SCALE_CTRL1                  0x5601U
    #define OV5640_SCALE_CTRL2                  0x5602U
    #define OV5640_SCALE_CTRL3                  0x5603U
    #define OV5640_SCALE_CTRL4                  0x5604U
    #define OV5640_SCALE_CTRL5                  0x5605U
    #define OV5640_SCALE_CTRL6                  0x5606U


    /* AVG control [0x5680 ~ 0x56A2]                         */
    #define OV5640_X_START_HIGH                 0x5680U
    #define OV5640_X_START_LOW                  0x5681U
    #define OV5640_Y_START_HIGH                 0x5682U
    #define OV5640_Y_START_LOW                  0x5683U
    #define OV5640_X_WINDOW_HIGH                0x5684U
    #define OV5640_X_WINDOW_LOW                 0x5685U
    #define OV5640_Y_WINDOW_HIGH                0x5686U
    #define OV5640_Y_WINDOW_LOW                 0x5687U
    #define OV5640_WEIGHT00                     0x5688U
    #define OV5640_WEIGHT01                     0x5689U
    #define OV5640_WEIGHT02                     0x568AU
    #define OV5640_WEIGHT03                     0x568BU
    #define OV5640_WEIGHT04                     0x568CU
    #define OV5640_WEIGHT05                     0x568DU
    #define OV5640_WEIGHT06                     0x568EU
    #define OV5640_WEIGHT07                     0x568FU
    #define OV5640_AVG_CTRL10                   0x5690U
    #define OV5640_AVG_WIN_00                   0x5691U
    #define OV5640_AVG_WIN_01                   0x5692U
    #define OV5640_AVG_WIN_02                   0x5693U
    #define OV5640_AVG_WIN_03                   0x5694U
    #define OV5640_AVG_WIN_10                   0x5695U
    #define OV5640_AVG_WIN_11                   0x5696U
    #define OV5640_AVG_WIN_12                   0x5697U
    #define OV5640_AVG_WIN_13                   0x5698U
    #define OV5640_AVG_WIN_20                   0x5699U
    #define OV5640_AVG_WIN_21                   0x569AU
    #define OV5640_AVG_WIN_22                   0x569BU
    #define OV5640_AVG_WIN_23                   0x569CU
    #define OV5640_AVG_WIN_30                   0x569DU
    #define OV5640_AVG_WIN_31                   0x569EU
    #define OV5640_AVG_WIN_32                   0x569FU
    #define OV5640_AVG_WIN_33                   0x56A0U
    #define OV5640_AVG_READOUT                  0x56A1U
    #define OV5640_AVG_WEIGHT_SUM               0x56A2U

    /* LENC control [0x5800 ~ 0x5849]                        */
    #define OV5640_GMTRX00                      0x5800U
    #define OV5640_GMTRX01                      0x5801U
    #define OV5640_GMTRX02                      0x5802U
    #define OV5640_GMTRX03                      0x5803U
    #define OV5640_GMTRX04                      0x5804U
    #define OV5640_GMTRX05                      0x5805U
    #define OV5640_GMTRX10                      0x5806U
    #define OV5640_GMTRX11                      0x5807U
    #define OV5640_GMTRX12                      0x5808U
    #define OV5640_GMTRX13                      0x5809U
    #define OV5640_GMTRX14                      0x580AU
    #define OV5640_GMTRX15                      0x580BU
    #define OV5640_GMTRX20                      0x580CU
    #define OV5640_GMTRX21                      0x580DU
    #define OV5640_GMTRX22                      0x580EU
    #define OV5640_GMTRX23                      0x580FU
    #define OV5640_GMTRX24                      0x5810U
    #define OV5640_GMTRX25                      0x5811U
    #define OV5640_GMTRX30                      0x5812U
    #define OV5640_GMTRX31                      0x5813U
    #define OV5640_GMTRX32                      0x5814U
    #define OV5640_GMTRX33                      0x5815U
    #define OV5640_GMTRX34                      0x5816U
    #define OV5640_GMTRX35                      0x5817U
    #define OV5640_GMTRX40                      0x5818U
    #define OV5640_GMTRX41                      0x5819U
    #define OV5640_GMTRX42                      0x581AU
    #define OV5640_GMTRX43                      0x581BU
    #define OV5640_GMTRX44                      0x581CU
    #define OV5640_GMTRX45                      0x581DU
    #define OV5640_GMTRX50                      0x581EU
    #define OV5640_GMTRX51                      0x581FU
    #define OV5640_GMTRX52                      0x5820U
    #define OV5640_GMTRX53                      0x5821U
    #define OV5640_GMTRX54                      0x5822U
    #define OV5640_GMTRX55                      0x5823U
    #define OV5640_BRMATRX00                    0x5824U
    #define OV5640_BRMATRX01                    0x5825U
    #define OV5640_BRMATRX02                    0x5826U
    #define OV5640_BRMATRX03                    0x5827U
    #define OV5640_BRMATRX04                    0x5828U
    #define OV5640_BRMATRX05                    0x5829U
    #define OV5640_BRMATRX06                    0x582AU
    #define OV5640_BRMATRX07                    0x582BU
    #define OV5640_BRMATRX08                    0x582CU
    #define OV5640_BRMATRX09                    0x582DU
    #define OV5640_BRMATRX20                    0x582EU
    #define OV5640_BRMATRX21                    0x582FU
    #define OV5640_BRMATRX22                    0x5830U
    #define OV5640_BRMATRX23                    0x5831U
    #define OV5640_BRMATRX24                    0x5832U
    #define OV5640_BRMATRX30                    0x5833U
    #define OV5640_BRMATRX31                    0x5834U
    #define OV5640_BRMATRX32                    0x5835U
    #define OV5640_BRMATRX33                    0x5836U
    #define OV5640_BRMATRX34                    0x5837U
    #define OV5640_BRMATRX40                    0x5838U
    #define OV5640_BRMATRX41                    0x5839U
    #define OV5640_BRMATRX42                    0x583AU
    #define OV5640_BRMATRX43                    0x583BU
    #define OV5640_BRMATRX44                    0x583CU
    #define OV5640_LENC_BR_OFFSET               0x583DU
    #define OV5640_MAX_GAIN                     0x583EU
    #define OV5640_MIN_GAIN                     0x583FU
    #define OV5640_MIN_Q                        0x5840U
    #define OV5640_LENC_CTRL59                  0x5841U
    #define OV5640_BR_HSCALE_HIGH               0x5842U
    #define OV5640_BR_HSCALE_LOW                0x5843U
    #define OV5640_BR_VSCALE_HIGH               0x5844U
    #define OV5640_BR_VSCALE_LOW                0x5845U
    #define OV5640_G_HSCALE_HIGH                0x5846U
    #define OV5640_G_HSCALE_LOW                 0x5847U
    #define OV5640_G_VSCALE_HIGH                0x5848U
    #define OV5640_G_VSCALE_LOW                 0x5849U

    /* AFC control [0x6000 ~ 0x603F]                         */
    #define OV5640_AFC_CTRL00                   0x6000U
    #define OV5640_AFC_CTRL01                   0x6001U
    #define OV5640_AFC_CTRL02                   0x6002U
    #define OV5640_AFC_CTRL03                   0x6003U
    #define OV5640_AFC_CTRL04                   0x6004U
    #define OV5640_AFC_CTRL05                   0x6005U
    #define OV5640_AFC_CTRL06                   0x6006U
    #define OV5640_AFC_CTRL07                   0x6007U
    #define OV5640_AFC_CTRL08                   0x6008U
    #define OV5640_AFC_CTRL09                   0x6009U
    #define OV5640_AFC_CTRL10                   0x600AU
    #define OV5640_AFC_CTRL11                   0x600BU
    #define OV5640_AFC_CTRL12                   0x600CU
    #define OV5640_AFC_CTRL13                   0x600DU
    #define OV5640_AFC_CTRL14                   0x600EU
    #define OV5640_AFC_CTRL15                   0x600FU
    #define OV5640_AFC_CTRL16                   0x6010U
    #define OV5640_AFC_CTRL17                   0x6011U
    #define OV5640_AFC_CTRL18                   0x6012U
    #define OV5640_AFC_CTRL19                   0x6013U
    #define OV5640_AFC_CTRL20                   0x6014U
    #define OV5640_AFC_CTRL21                   0x6015U
    #define OV5640_AFC_CTRL22                   0x6016U
    #define OV5640_AFC_CTRL23                   0x6017U
    #define OV5640_AFC_CTRL24                   0x6018U
    #define OV5640_AFC_CTRL25                   0x6019U
    #define OV5640_AFC_CTRL26                   0x601AU
    #define OV5640_AFC_CTRL27                   0x601BU
    #define OV5640_AFC_CTRL28                   0x601CU
    #define OV5640_AFC_CTRL29                   0x601DU
    #define OV5640_AFC_CTRL30                   0x601EU
    #define OV5640_AFC_CTRL31                   0x601FU
    #define OV5640_AFC_CTRL32                   0x6020U
    #define OV5640_AFC_CTRL33                   0x6021U
    #define OV5640_AFC_CTRL34                   0x6022U
    #define OV5640_AFC_CTRL35                   0x6023U
    #define OV5640_AFC_CTRL36                   0x6024U
    #define OV5640_AFC_CTRL37                   0x6025U
    #define OV5640_AFC_CTRL38                   0x6026U
    #define OV5640_AFC_CTRL39                   0x6027U
    #define OV5640_AFC_CTRL40                   0x6028U
    #define OV5640_AFC_CTRL41                   0x6029U
    #define OV5640_AFC_CTRL42                   0x602AU
    #define OV5640_AFC_CTRL43                   0x602BU
    #define OV5640_AFC_CTRL44                   0x602CU
    #define OV5640_AFC_CTRL45                   0x602DU
    #define OV5640_AFC_CTRL46                   0x602EU
    #define OV5640_AFC_CTRL47                   0x602FU
    #define OV5640_AFC_CTRL48                   0x6030U
    #define OV5640_AFC_CTRL49                   0x6031U
    #define OV5640_AFC_CTRL50                   0x6032U
    #define OV5640_AFC_CTRL51                   0x6033U
    #define OV5640_AFC_CTRL52                   0x6034U
    #define OV5640_AFC_CTRL53                   0x6035U
    #define OV5640_AFC_CTRL54                   0x6036U
    #define OV5640_AFC_CTRL55                   0x6037U
    #define OV5640_AFC_CTRL56                   0x6038U
    #define OV5640_AFC_CTRL57                   0x6039U
    #define OV5640_AFC_CTRL58                   0x603AU
    #define OV5640_AFC_CTRL59                   0x603BU
    #define OV5640_AFC_CTRL60                   0x603CU
    #define OV5640_AFC_READ58                   0x603DU
    #define OV5640_AFC_READ59                   0x603EU
    #define OV5640_AFC_READ60                   0x603FU

    /**
     * @}
     */

    /************** Generic Function  *******************/

    typedef int32_t (*OV5640_Write_Func)(void *, uint16_t, uint8_t *, uint16_t);
    typedef int32_t (*OV5640_Read_Func)(void *, uint16_t, uint8_t *, uint16_t);

    typedef struct
    {
        OV5640_Write_Func WriteReg;
        OV5640_Read_Func  ReadReg;
        void             *handle;
    } ov5640_ctx_t;

    /*******************************************************************************
     * Register      : Generic - All
     * Address       : Generic - All
     * Bit Group Name: None
     * Permission    : W
     *******************************************************************************/
    int32_t ov5640_write_reg(ov5640_ctx_t *ctx, uint16_t reg, uint8_t *pdata, uint16_t length);
    int32_t ov5640_read_reg(ov5640_ctx_t *ctx, uint16_t reg, uint8_t *pdata, uint16_t length);

    int32_t ov5640_register_set(ov5640_ctx_t *ctx, uint16_t reg, uint8_t value);
    int32_t ov5640_register_get(ov5640_ctx_t *ctx, uint16_t reg, uint8_t *value);


    /**
     * @}
     */
    #ifdef __cplusplus
}
    #endif

#endif /* OV5640_REG_H */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
